Catalogs/СостоянияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ожидаем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СостоянияEmail/Ext/Module.bsl
Процедура ОжиданиеEmail(from_id, email = Неопределено) Экспорт
	Ссылка = Справочники.СостоянияПользователей.НайтиПоРеквизиту("Пользователь", Строка(from_id));   
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Состояние = Ссылка.ПолучитьОбъект();
	Иначе
		Состояние = Справочники.СостоянияПользователей.СоздатьЭлемент();    
		Состояние.Пользователь = from_id;
	КонецЕсли;
	
	Если email = Неопределено Тогда
		Состояние.Ожидаем = Истина; 
	Иначе
		ВалидныйEmail = ПроверитьEmail(email);
		Если ВалидныйEmail Тогда
			Состояние.Email = email;
			Состояние.Ожидаем = Ложь;    
			
			Заказы.СоздатьЗаказ(from_id, email);  
		КонецЕсли
	КонецЕсли;     
	
	Состояние.Записать(); 
КонецПроцедуры 

Функция ПроверитьEmail(email) Экспорт
    // 1. Проверяем, что есть ровно один '@'
    Если СтрНайти(email, "@") = 0 Тогда 
        Возврат Ложь; 
    КонецЕсли;
    // Разбиваем по '@'
    parts = СтрРазделить(email, "@");
    Если parts.Количество() <> 2 Тогда 
        Возврат Ложь; 
    КонецЕсли;
    // Проверяем, что в домене есть хотя бы одна точка, и до/после не пусто
    domain = parts[1];
    Если СтрНайти(domain, ".") = 0 Тогда 
        Возврат Ложь; 
    КонецЕсли;
    // Простая проверка на недопустимые символы
    Возврат Истина;
КонецФункции
